{
    "overall_rating": 10,
    "reviews": [
    {
        "author": null,
        "body": "So far I have enjoyed my app. It has given me the options to customize my products the way I need to. I look forward to seeing other options and upgrades avail. for this app. However for someone who isn't very good with computers this app was easy for me to use. I was able to ask questions and get help from the support team very quickly. They seem to be pleasant and genuine with wanting to help me succeed.  Customer service is on the decline and its always good to find people that still enjoy helping others. I love this app and I hope it grows my business further. ",
        "created_at": "2017-10-29T15:20:45.000-04:00",
        "shop_domain": "create-my-natural.myshopify.com",
        "shop_name": "Create My Natural",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "We LOVE this app! It's revolutionized our gourmet popcorn business, giving us the ability to offer custom popcorn orders to our fans across the country. Not only is the software awesome, but Bold's customer service is second-to-none. They've always been quick to help with any problem we might encounter. Check out our builder here: https://thepoppedpopcorncompany.com/apps/productbuilder/build-a-tin",
        "created_at": "2017-09-26T18:20:07.000-04:00",
        "shop_domain": "the-popped-popcorn-company.myshopify.com",
        "shop_name": "The Popped Popcorn Company",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Have to agree with Laced Decal. They say in the listing that it is FULLY CUSTOMISABLE. To better prepare, and to ensure honesty, we even asked Bold if our devs would easily be able to change the design according to our own, and they said an absolute 'yes'. So we paid $$$ to have the design made, and it's been over a year and we are yet to find a dev that can do this for us. Our dev is AMAZING and can do anything...he's been with us for over 10 years as he is a wiz, and even he can't do as our design requires.\r\n\r\nCurrently searching for a new app.\r\n\r\n",
        "created_at": "2017-09-05T23:38:57.000-04:00",
        "shop_domain": "chibebe-au.myshopify.com",
        "shop_name": "Chibebe Au",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Honestly, YOU (bold) could do better.\r\n\r\nFirst let's start with the most important part of this review. Most of the good reviews of this app seem to be fake. How I recognize that is by going to all of the stores that all these positive reviews lead too. 90% of them don't use this apps services, so its hard to believe they just think its cool to pay you guys to not use your poor services. DON'T use this app unless your whole entire business strategy depends on it.\r\n\r\n Visually, this app looks absolutely terrible. Besides the lack of support, difficult settings, and poor design of software, the page that the app produces on your store is hideous! Like, we are talking craigslist style. Don't waste your time or money on this app. \r\n\r\nSecond I want to tell you about how difficult programming this app is. Notice I said \"programming\", because that is exactly what you have to do to get the app to work. To make this app work for your store, you literally have to write code like sets of rules. Which by the way is explained no where in the tutorial sections of this app. Also to let it even go live on your store you actually do have to mess with the code of your store. So just to be able to understand how to use this app, and/or install it, you're going to need some knowledge in computer programming.\r\n\r\nThirdly let me go over what I mean by hideous. After 4 hours teasing my brain trying to figure out the mechanics of this app, I found out that the page it actually produces (build a product page) is visually awful! They give you very little options of changing the layout of the page, but even the options you do have don't do much. It is next to impossible to be able to match this 'build a product' page to your actual store. The design of the page literally looks like you are on craigslist. Absolutely no modern influence seemed to have gone into the visual designing of this software.\r\n\r\nMy honest opinion of the app is that, BOLD OWES ME MONEY. Just like the rest of you shoppifiers, my time is valuable. Sadly, I put a lot of time into trying to get this to work only to find out it is a COMPLETE RIP OFF of time and money at the rate they charge.\r\n\r\nSeriously, they should be paying us to use it just to fix all of their problems. The developers of this app seem like the type of people that I hate through what they have produced. Money hungry let downs that don't understand the importance of quality work. If they did, they wouldn't be charging $60 dollars a month for me to have a headache and waste advertising money on a page that looks worse than Trumps hair cut.\r\n\r\nCome on guys, again YOU CAN DO BETTER.",
        "created_at": "2017-08-23T09:25:38.000-04:00",
        "shop_domain": "laced-decal.myshopify.com",
        "shop_name": "Laced Decal",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Was excited to find this app, essentially it's exactly what I need. Unfortunately after you add all your products and options in the last step you have to click a button to \"generate image scenarios\" to assign an individual image for each scenario. Makes sense, but if you ever change or add an option that affects the assigned images, you have to click that button again to REgenerate the new scenarios and it erases ALL of your past uploads. If you never intend on adding products after your intial upload to the app, it would be fine. BOLD something to think about improving possibly?\r\n\r\nThe back end was a bit clunky and hard to make changes (font, frame size, photo size) for a non programmer. I mean I'm on shopify because I'm not a programmer right?\r\n\r\nI paid to have the app installed because again, I'm not a programmer. The customer service was a bit lacking pending the installation of the app but the follow up after my review shows BOLD does indeed care about their brand and has potential to provide adequate customer support. ",
        "created_at": "2017-08-12T00:48:25.000-04:00",
        "shop_domain": "curatedmass.myshopify.com",
        "shop_name": "Curatedmass",
        "star_rating": 2
    },
    {
        "author": null,
        "body": "Uninstalled the app within hours due to lack of support, and we were right, its been about a month and we haven't yet received the REFUND, and worse, there is no communication from support, once asked about it",
        "created_at": "2017-08-10T04:48:04.000-04:00",
        "shop_domain": "saraf-furniture.myshopify.com",
        "shop_name": "Saraf Furniture",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Absolutely LOVE this App!! It does exactly what I need for my brand and to sell my particular line of products, which can become complex, since we offer full customization to our clients.  Product Builder allowed us to do just that, and made it easy enough for even someone like myself, to use it and complete the outcome I was looking for! \r\n\r\nA SPECIAL MAHALO to Shubhneet, Marty, Paul and Alexa for all their help along the way.  And I definitely needed it, as this was the first time I ever attempted to create something like this in my own.  Whenever I had a question, or got stuck, they assisted me pretty fast and made and made great suggestions that helped me tremendously.\r\n\r\nI would HIGHLY Recommend this app, especially for those who offer their clients that extra special touch of building their own product! ",
        "created_at": "2017-07-18T19:48:24.000-04:00",
        "shop_domain": "blithe-bikinis.myshopify.com",
        "shop_name": "Blithe Bikinis",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app' but can get quite complex if you have a large number of options - particularly images. Work on simplifying this with a duplicate feature or bulk upload option would make a huge improvement.\r\nWe use it to configure a custom built fly rod or kit and has been customised to integrate with inventory which seems to work well.\r\n- Updated - Uninstalled this some time ago, not optimised for mobile and pretty much unusable as such. We spend a huge amount customizing this with this company. Never again",
        "created_at": "2017-05-13T01:15:40.000-04:00",
        "shop_domain": "swiftoutdoors.myshopify.com",
        "shop_name": "Swiftoutdoors",
        "star_rating": 2
    },
    {
        "author": null,
        "body": "Been paying for this ap for months now (second time I have downloaded it and tried to get somewhere) First off NOT OPTIMIZED for mobile??? Ummm really? Anyone who knows anything about e commerce knows that 78% of customers are now using mobile devices or tablets to shop and checkout on online stores. What are we in 1997 thinking people are on desk tops, The numbers don't lie. This could be such a huge tool for us and despite trying to figure it out on our own and a few phone calls with the company we are still no closer to getting any resolution. We then asked them well how would we get this to fit and be optimized for mobile format and came back with a price of $6,000 dollars! To which my question is WHY NOT just have your people optimize it on your own dime being it will help ALL of your customers being again there is such a huge number of people using mobile devices to shop in our current time. 100% discouraged and dissatisfied. If you do not know code then do not even bother.",
        "created_at": "2017-05-11T18:53:22.000-04:00",
        "shop_domain": "redneck-nation.myshopify.com",
        "shop_name": "Redneck Nation",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "I will start by saying that there is no other app like this in the Shopify app store! I offer custom framing and to purchase custom picture framing software is very hard to find and when you do it's beyond expensive! I needed the ability to have a client pick a frame and then matting selection and then any options and show the client a preview image of any combination they would be selecting. The Product Builder app does it and it does it with ease! I will not lie, it will take a good while to initially set everything up because you could be dealing with thousands of image, but it's totally worth the time that you put it! One of the biggest concerns I had going in was support. I know that I would be needing support with issues and questions that I would have. It's been three weeks now since I started using the app and I have reached out to support many times, and was pleasantly surprised! Between chat and emails, my questions where answered very quickly usually within 24 hours, if not sooner. The also offer phone support, which is a rare thing now a day! I would highly recommend this app! They offer a free 30 day trail, so take the time to download and give it a go!",
        "created_at": "2017-05-05T11:05:53.000-04:00",
        "shop_domain": "frame-your-dress.myshopify.com",
        "shop_name": "Frame Your Dress",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Amazing service, amazing product, and amazing speed! Thank you so much for everything you guys do over there at Bold, you have no idea how much time you saved me trying to figure this all out on my own",
        "created_at": "2017-04-20T22:30:30.000-04:00",
        "shop_domain": "kaiser-trading.myshopify.com",
        "shop_name": "Kaiser Trading",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "For starters, this is a very well constructed app that not only functions exactly as they said, but also for changes to the product to made easily and enough customization where one can really provide customers with an experience that aligns to their brand.\r\n\r\nHowever, even more important is the great service. We had some issues installing into our theme, and the Bold support team was quick to respond and worked with us every step of the way to ensure our problem was completely resolved.\r\n\r\nI do not write reviews very often, but felt that it necessary in this case. Strongly recommend this app!",
        "created_at": "2017-03-31T10:26:13.000-04:00",
        "shop_domain": "princeton-audio.myshopify.com",
        "shop_name": "Princeton Audio",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Gosh, that is a pretty good technical support.\r\n\r\nWhile many companies barely just offer a simple reception desk, Bold commerce has put the bar very high by offering a real technical support for their apps.\r\n\r\nThose people really know their software and have an excellent sense of what means \"customer support\".\r\n\r\nI came to Bold commerce for their amazing software add-on for shopify, and I will keep working with them for the very high level of support they offer which make me and my company confident to deploy their solutions.\r\n\r\nGuys, I just have to say \"excellent job\", I am really impressed.\r\n\r\nPS: special mention to Alexa who supported my zillion questions over more than 5hours with always a nice chat and very efficient knowledge.\r\n\r\nDo I have to say I recommend them? ;-)\r\n\r\nPS: No, I am not a fake comment, I am just very happy to have found a company who knows what means supporting their clients.\r\n\r\nThank you.",
        "created_at": "2017-03-28T16:52:22.000-04:00",
        "shop_domain": "360tovisit.myshopify.com",
        "shop_name": "360tovisit",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I have sent 5 support emails the items were not creating the correct total I am so disappointed with this product plus they started billing me the 60 a month I have not even got a notification saying when or if they plan on helping, I hope this only a temporary setback since their is no alternative and I will have to leave shopify  ",
        "created_at": "2017-01-31T10:40:53.000-05:00",
        "shop_domain": "happyweedfarmer.myshopify.com",
        "shop_name": "Happyweedfarmer",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Love this app, when I was trying to build my website I was told it couldn't be done. Found this app and it has made it not only possible but easy. Lifer savers\r\nThanks\r\nHayden",
        "created_at": "2017-01-14T19:01:17.000-05:00",
        "shop_domain": "tailored-nz-2.myshopify.com",
        "shop_name": "Tailored Nz 2",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great support and good range of configuration options. Looking forward to my site launch!",
        "created_at": "2016-12-05T17:54:42.000-05:00",
        "shop_domain": "packdin.myshopify.com",
        "shop_name": "Packdin",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "We downloaded this app, product upsell, and product discount. Jordan helped me out on all the questions I had to be live and ready by Friday 12:00 AM. It's great that Bold has all the apps you need so you only need to contact 1 person for all of your questions. Customer service was absolutely amazing. Thank you guys for opening up your support 24/7 during the biggest sale weekend in the states.",
        "created_at": "2016-11-25T01:28:51.000-05:00",
        "shop_domain": "getfitandthick.myshopify.com",
        "shop_name": "Getfitandthick",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Really thing the Product Builder will comply with all our demands. We would like our customers to build their bed mattress for mattress based on certain criteria's, and Product Build allow them to do exactly that. Takes some time to learn how it works (at least for me...), but I am sure it will work out nicely. Good support and tutorials! ",
        "created_at": "2016-11-08T02:25:52.000-05:00",
        "shop_domain": "coco-mat-norge.myshopify.com",
        "shop_name": "Coco Mat Norge",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "The product builder team is very supportive and helps you all the way through! Can't say enough good things. The app it self is great, can be tricky to set up but not as nearly as tricky and expensive as having someone build one for you from scratch. MC and Alexa rock.",
        "created_at": "2016-10-18T10:56:19.000-04:00",
        "shop_domain": "americanvinylco.myshopify.com",
        "shop_name": "Americanvinylco",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "We use several of Bold's Apps at Crystal Quest.  Top notch support.  Always a pleasure dealing with them.  Can't wait to start using Product Builder!",
        "created_at": "2016-09-23T16:06:16.000-04:00",
        "shop_domain": "crystal-quest-water-filters.myshopify.com",
        "shop_name": "Crystal Quest Water Filters",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Absolutely top notch customer service. Thank you so much Bold for helping me get everything set up and going!",
        "created_at": "2016-07-08T16:43:52.000-04:00",
        "shop_domain": "pokeproducts.myshopify.com",
        "shop_name": "Pokeproducts",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The App did not work for what we wanted. it is difficult to get setup. we have canceled the app for us and are waiting for a refund from Bold for the liquid installation for this app and another one that we had them do so we could try.  Bold promises that they would refund the money if the app did not work. ",
        "created_at": "2016-07-06T11:30:25.000-04:00",
        "shop_domain": "bay-way-window-fashions.myshopify.com",
        "shop_name": "Bay Way Window Fashions",
        "star_rating": 3
    },
    {
        "author": null,
        "body": "We just launched Our Shirt Builder app.  Great app, easy to use!  https://axelsltd.com/apps/productbuilder/made-to-measure",
        "created_at": "2016-06-21T13:55:45.000-04:00",
        "shop_domain": "stirling-shoes.myshopify.com",
        "shop_name": "Stirling Shoes",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Excellent application. Searched for numerous applications for my shopify store and this was the only one that is able to fulfill all my requirements! By the way, I have looked for other apps developed by Bold and they all seem really useful!  ",
        "created_at": "2016-06-20T11:51:29.000-04:00",
        "shop_domain": "lojajulienbruno.myshopify.com",
        "shop_name": "Lojajulienbruno",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The perfect app for our store! \r\n\r\nWe couldn't find a way to allow our customers to build their custom birthday boxes that felt fun and inviting. The only thing out there was drop down menus, which definitely didn't work with our idea of having fun building your boxes.\r\n\r\nProduct builder is exactly what we had envisioned for our store, allowing customers to go step by step, picking their products and building their box. It allows you to write a description for each step as well as a hover feature over each selection. So if you have three candles, you can input a candle description to describe the scent so that when the customer hovers over the picture they get even more detail!\r\n\r\nWe beyond love this app and the customization it brings to our site! Highly recommend!",
        "created_at": "2016-06-07T17:47:29.000-04:00",
        "shop_domain": "alongcameabox.myshopify.com",
        "shop_name": "Alongcameabox",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Brilliant app. Allows unlimited customisation.",
        "created_at": "2016-06-07T05:03:51.000-04:00",
        "shop_domain": "yourplumbstop-co-uk.myshopify.com",
        "shop_name": "Yourplumbstop Co Uk",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great App! \r\nUnlimited possibilities with this one, and very user friendly :)",
        "created_at": "2016-06-01T05:05:27.000-04:00",
        "shop_domain": "the-joota.myshopify.com",
        "shop_name": "The Joota",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great apps and very efficient customer support! I am ready to install other apps from BOLD!",
        "created_at": "2016-05-30T22:08:16.000-04:00",
        "shop_domain": "modelartdisplay.myshopify.com",
        "shop_name": "Modelartdisplay",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Always great customer service and has worked perfectly for our store!",
        "created_at": "2016-05-25T17:06:00.000-04:00",
        "shop_domain": "maskcara-2.myshopify.com",
        "shop_name": "Maskcara 2",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Excellent Support and incredible apps. \r\nHave some Bold apps and really happy with all of them\r\n\r\n",
        "created_at": "2016-04-28T12:58:49.000-04:00",
        "shop_domain": "oh-my-shorts.myshopify.com",
        "shop_name": "Oh My Shorts",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Amazing app! It can take time to setup based on how complex we want the builder to be but it's so worth it! Bold's team is the best - they always reply really fast and are always ready to help us with any question or problem we have with the app. ",
        "created_at": "2016-04-13T15:13:52.000-04:00",
        "shop_domain": "power-ton-web-shop.myshopify.com",
        "shop_name": "Power Ton Web Shop",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app for allowing customers the ability to custom build a product with many options.",
        "created_at": "2016-03-28T13:40:15.000-04:00",
        "shop_domain": "supercross-bmx-2.myshopify.com",
        "shop_name": "Supercross Bmx 2",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I have two Bold apps installed and I could not be happier! The apps are amazing and have really worked wonders for my store. Customer service is beyond amazing. Thank you so much!",
        "created_at": "2016-03-14T13:58:21.000-04:00",
        "shop_domain": "bipandbop.myshopify.com",
        "shop_name": "Bipandbop",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "When we were stuck on what to do when we could not integrate customise builder to our website we were stuck, until we stumbled on Bold Product Builder which had the foundation to get it to do what we wanted it to. But with set back on functionality front when I was near about to give up on it, Dex from Bold support team came to the rescue. I must say Dex knew straight away what I needed and how I needed it to function whilst all the team at Bold are helpful and will go the extra mile, Dex was exceptional and is a great asset to your team and I would highly recommend using this app if you need custom builder. \r\n\r\n\r\nWarmest regards,\r\n\r\n\r\nMo\r\nwww.mayoclothier.com",
        "created_at": "2016-02-24T06:58:32.000-05:00",
        "shop_domain": "mayo-clothier.myshopify.com",
        "shop_name": "Mayo Clothier",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Love this app! Building a product from the ground up is an essential part of our store and this app really delivers. Installation instructions were easy to follow, but the cost for them to install isn't bad either. It was easy to add my product variants and customize the look and feel to suit my store. Bold provides lots of help along the way if you encounter a problem. Highly recommend this app and the company!",
        "created_at": "2016-02-06T14:23:30.000-05:00",
        "shop_domain": "claylabbeauty.myshopify.com",
        "shop_name": "Claylabbeauty",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Excellent app and customer service!\r\n",
        "created_at": "2016-02-02T21:18:59.000-05:00",
        "shop_domain": "pineapple-rolls.myshopify.com",
        "shop_name": "Pineapple Rolls",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Finding and integrating the Product Builder app was a no-brainer to get my store up and running.  I opted to have the Bold team do the Shopify theme integration (which was very inexpensive) they added the Builder very quickly and immediately were available to see if I had any questions as I got started using it.  I signed up for a webinar and Dex was my dev rep.  He was super helpful and answered all my questions while giving me some tips along the way, like the Hidden Products fields!  I really appreciate companies like Bold that care about their new customer's and their initial experience.  I think the Product Builder will be a key component to my store's success.  \r\n\r\np.s. One plea - if there's anyway to add an overlay feature to the preview image in the app I think that would be icing on the cake.  I would be happy to be a beta for it if that's an enhancement you roll out one day!\r\n\r\nCheers,\r\n\r\nKate from Honolulu\r\nMYOMonster.com",
        "created_at": "2016-01-08T03:09:09.000-05:00",
        "shop_domain": "myomonster.myshopify.com",
        "shop_name": "Myomonster",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Very powerful App and great support.",
        "created_at": "2015-11-27T02:31:30.000-05:00",
        "shop_domain": "hamilton-in-a-box.myshopify.com",
        "shop_name": "Hamilton In A Box",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Really good app! Needs a little custom CSS to make it fit well with your store but the team at bold can help with that. ",
        "created_at": "2015-11-21T07:39:09.000-05:00",
        "shop_domain": "sokx.myshopify.com",
        "shop_name": "Sokx",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Outstanding app that does what no other app I have found can do! Outstanding customer service with Dex walking me through every question! ",
        "created_at": "2015-11-13T08:20:26.000-05:00",
        "shop_domain": "sugar-hill-furniture-company.myshopify.com",
        "shop_name": "Sugar Hill Furniture Company",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Awesome Help from Dex. He was very knowledgeable and helped me with all my inquiries. These guys are great support team. A+++++++++++++++++++++++\r\n\r\nIt is a small company so you don't get lost in the shuffle of millions of other customers. They are always asking if you need help. \r\n\r\nI would highly recommend this app.",
        "created_at": "2015-11-11T10:21:46.000-05:00",
        "shop_domain": "designerfabricandfurniturewarehouse.myshopify.com",
        "shop_name": "Designerfabricandfurniturewarehouse",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Using Product Builder, we created Design A Bed, which allows our customers to design their own bed sets by picking from different bed head and base designs and fabrics. Each step of the design process displays a beautiful preview image and allows us to directly link the choices made to our shop's products. \r\n\r\nAll this functionality is built into the app and is extremely intuitive and easy to use. When we needed customizations done or issues addressed, the Bold Apps support team were quick to respond and very, very helpful.\r\n\r\nWe love this app so much that we have begun regularly releasing new designs weekly. All in all, a great experience!\r\n\r\nThank you Bold Apps!",
        "created_at": "2015-10-13T01:03:36.000-04:00",
        "shop_domain": "brosa-dev.myshopify.com",
        "shop_name": "Brosa Dev",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "It really solved all my problems I faced adding options to my products. Once it is installed it is easy to use and works every time. I can reccomend it to anyone struggling with adding different options.",
        "created_at": "2015-09-23T10:13:40.000-04:00",
        "shop_domain": "smartofficesolution.myshopify.com",
        "shop_name": "Smartofficesolution",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "DON'T BUY THIS PRODUCT.\r\n\r\nNot only is the management interface very, very unintuitive and inefficient to add products, options, and images (uploading each image and option variation image takes about 6 clicks - ugh. No bulk upload either.)\r\n\r\nBIGGEST GRIPE: This product has a deal-breaker piece of functionality. When you add products and product options - you have to click a button to \"generate image scenarios\" so that you can upload an individual image for each scenario. This is all well and good, but now let's say you ever change or add an option. You have to click that button again to generate the new scenarios. Guess what. IT ERASES EVERY IMAGE YOU'VE EVER UPLOADED. So if you, like me, had thousands of images saved to various scenarios (product + artwork + color, etc) - then you have to go through and upload EACH IMAGE AGAIN, one at a time (6 clicks to upload each image). This user experience alone should stop you from wasting $60/month on this product.\r\n\r\nIf you build your Product Builder and never want to ever change it again, than this product may just work for you.",
        "created_at": "2015-09-18T16:08:22.000-04:00",
        "shop_domain": "beer-city-glass.myshopify.com",
        "shop_name": "Beer City Glass",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Not only is the app incredible, but so is the support behind it. If I ever need any questions answered, I'm confident that the Bold support team would be there to help me. The app plays a key role in the success of my website and I'm grateful for that.",
        "created_at": "2015-08-11T06:15:03.000-04:00",
        "shop_domain": "beckwick-candle.myshopify.com",
        "shop_name": "Beckwick Candle",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "What an app!  This app allowed my company to do something that no one else in our industry is doing!  A custom build your own bug out / emergency bag is the edge we needed!  Great job Bold!",
        "created_at": "2015-07-28T01:59:36.000-04:00",
        "shop_domain": "blackbeard-corporation.myshopify.com",
        "shop_name": "Blackbeard Corporation",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "So excited to have found this app and so far it is awesome.  Of course people, you have to put in the work to make it what you want but when you decide how you want it, nothing compares.",
        "created_at": "2015-07-20T13:33:13.000-04:00",
        "shop_domain": "laboratoryeight.myshopify.com",
        "shop_name": "Laboratoryeight",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Very handy app. Took me a while to work out how it all works but I like it. I think it will offer my store something a little extra!",
        "created_at": "2015-06-28T18:03:17.000-04:00",
        "shop_domain": "raiseys.myshopify.com",
        "shop_name": "Raiseys",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "This app is worth every penny. The installation process is simple if you take things slow. Alternatively you can pay the guys at Bold and they will install it for you. \r\n\r\nI have an extensive product being built in my store so it did take a while to set everything up but it's well worth it. There is nothing out there that is as powerful as this app and as easy to use. \r\n\r\nHaving an extensive product I have had to email the guys at Bold a couple of times for some help with alignment mostly. They reply within 24 hours every time letting you know they have fixed the issue for you. One of the best customer service experiences I have had from a company. Especially Michael who has personally helped with my project. They are very supportive! \r\n\r\nI would recommend this app to anyone who is selling custom products. It's well worth it! ",
        "created_at": "2015-06-08T12:26:32.000-04:00",
        "shop_domain": "suitablymade.myshopify.com",
        "shop_name": "SuitablyMade",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Thank you Bold Apps for helping me set up my 'Bikini Builder' on my shopify website. The Product Builder App has only been live 3 days and it has made my life so much easier. No more manual order forms :)\r\n\r\nI have had over a dozen orders in 3 days. This app along with all your other apps are amazing and simple.\r\n\r\nYour on-line support is FANTASTIC!\r\n\r\nGood job guys :)",
        "created_at": "2015-05-27T23:48:57.000-04:00",
        "shop_domain": "glam-fit-bikinis.myshopify.com",
        "shop_name": "Glam Fit Bikinis",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Amazing customer support and app!",
        "created_at": "2015-04-24T15:44:49.000-04:00",
        "shop_domain": "limitless-vaporizers.myshopify.com",
        "shop_name": "Limitless Vaporizers",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Thanks to Cory's help setting up. The Product Builder app is very useful with lots of great options.",
        "created_at": "2015-04-10T12:00:03.000-04:00",
        "shop_domain": "thinkitdrinkit-com.myshopify.com",
        "shop_name": "thinkitdrinkit.com",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I love this App I just installed it and I believe it will drive my sells through the roof. Customers love custom one of a kind products and with this app I can provide Custom College Life Gear!",
        "created_at": "2015-03-26T17:39:55.000-04:00",
        "shop_domain": "lnem-the-lifestyle.myshopify.com",
        "shop_name": "Late Nights Early Mornings",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The app itself is good and brings much needed functionality to Shopify however potential customers should be aware of a few bugs with this application and the lack of action, in my experience, in resolving them to date.\r\n\r\nI spent a considerable sum with Bold customising the app for my store but I have come across some crippling bugs. Having raised these issues my tickets were closed without resolution and merged into another ticket. Despite multiple attempts for a response that ticket is still open two months later and I have received no update. \r\n\r\nBugs happen, thats understandable, however high impact issues in this case have not been worked on and have been left as known issues with no updates as to when they will be resolved.\r\n\r\nMy main issue is that when updating products set within my builders they frequently do not save and they automatically duplicate the product description text, often 100 times! Also be aware that when updating product pricing in Shopify this does not flow into the products setup within the builder - this must be done manually (to show the correct price within the builder). This bug means that a manual update that should take a few hours (e.g. to update prices) can take days, literally. It is becoming unworkable and there has been no sign of a solution from Bold to date.\r\n\r\nSo be aware, if you have more than 100 products in your store, this app could become a real issue for your business until these bugs are actually addressed by Bold.\r\n\r\nIf these were fixed, I'd highly recommend it. As it stands, it comes with a few health warnings attached! Others seem to have had great support from Bold but in this case we have been let down so far - I hope I can update this review with more positive news at some point soon.",
        "created_at": "2015-03-15T19:19:44.000-04:00",
        "shop_domain": "amfora.myshopify.com",
        "shop_name": "Amfora: The Liquid Deli",
        "star_rating": 2
    },
    {
        "author": null,
        "body": "Absolutely awesome app. I had them install it for me, it was done in 48 hours. Extremely happy with the results",
        "created_at": "2015-02-10T23:14:10.000-05:00",
        "shop_domain": "dojowatches.myshopify.com",
        "shop_name": "Dojo Threads \u0026 Gear",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "So far, I'm giving Bold Apps a 5-star rating for their generous support assistance in getting Product Builder running on our site.  A special thanks to Cory at Bold for his hands-on help.  I'll update this review after we've had a chance to set up and test Product Builder.",
        "created_at": "2015-01-28T09:58:53.000-05:00",
        "shop_domain": "tabletop-gear.myshopify.com",
        "shop_name": "Tabletop Gear",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app! We are very pleased with the results. If you don't believe me, check it out for yourself at www.neoscustomsuits.com\r\n\r\nGreat service too. They went out of their way to modify the settings so the app looked even better. I highly recommend it.",
        "created_at": "2014-11-26T00:24:56.000-05:00",
        "shop_domain": "neoscustomsuits.myshopify.com",
        "shop_name": "Neos Custom Suits",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is excellent for building custom products or using as a guided product selection tool, and is an essential element of our web business.  The app is relatively self explanatory, full CSS editing allows us to customise almost all the visual elements.  Support has been excellent via the website, email ticketing and a one-on-one webinar with Cory (thank you Sir!) answered all my questions.  Everything - so far - has been very positive.",
        "created_at": "2014-11-25T16:14:33.000-05:00",
        "shop_domain": "james-mattresses.myshopify.com",
        "shop_name": "Sandman Bespoke Mattresses",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The best customer service of any App developer I have ever experienced. Would highly recommend Bold as well as this excellent app. It has big potential as well as been very easy to use once set up.",
        "created_at": "2014-11-14T07:37:38.000-05:00",
        "shop_domain": "personalise-online.myshopify.com",
        "shop_name": "Personalise Online",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "wonderful product. Excellent customer service and support!",
        "created_at": "2014-10-07T10:05:24.000-04:00",
        "shop_domain": "testtinyfoodies.myshopify.com",
        "shop_name": "tiny foodies",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "My company had the MOST AMAZING CUSTOMER SUPPORT from Michael at bold apps.  He answered all of my questions and was quick to respond. I had a few styling issues when I installed the app but Michael was able to quickly fix them at no cost! He even helped out with our checkout page and added some much needed css. Overall the app was easy to use and the customer support made my experience painless. I couldn't be happier with the app or the customer service! ",
        "created_at": "2014-10-01T15:19:21.000-04:00",
        "shop_domain": "highcomonline.myshopify.com",
        "shop_name": "HighCom Security",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This makes product customisation accessible to anyone who wants to start an innovative online product customisation store. At ownsewn.com we are bootstrapping our business and starting with a very small budget. This app helps us to keep adding as we go without lots of expensive web developer involvement.",
        "created_at": "2014-08-30T05:08:53.000-04:00",
        "shop_domain": "own-sewn.myshopify.com",
        "shop_name": "Own Sewn",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Exactly what we were looking for. Excellent customer service, they went above and beyond for us!",
        "created_at": "2014-08-26T14:23:35.000-04:00",
        "shop_domain": "findisms.myshopify.com",
        "shop_name": "Findisms",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Jeremy really helped us great with setting the whole app up - it is not difficult - however we needed some extra customization and that was not a problem! I would recommend this app to anyone as it is super versatile and I am sure anyone who wants some sort of customization - that it would fit to them! Thank you and looking forward to keep working with bold apps together! ",
        "created_at": "2014-08-18T14:22:47.000-04:00",
        "shop_domain": "your-superfoods.myshopify.com",
        "shop_name": "Your Superfoods",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great App, takes a long time to set up if you have a lot of options, but worth it.",
        "created_at": "2014-08-12T10:10:55.000-04:00",
        "shop_domain": "lifting-london.myshopify.com",
        "shop_name": "Lifting London",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great, quick responsive customer support. \r\nApp is responsive and exactly what we need for building custom machines.\r\nWould happily recommend. ",
        "created_at": "2014-07-17T19:42:22.000-04:00",
        "shop_domain": "lookup-shop.myshopify.com",
        "shop_name": "LOOKUP.shop",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Just what i need for customised products.\r\nSupport was good in identifying the problem and detailed handling.\r\nMust try for customisation products!",
        "created_at": "2014-07-16T16:41:14.000-04:00",
        "shop_domain": "lechapeauxcustoms-myshopify-com.myshopify.com",
        "shop_name": "LeChapeaux",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The App has been good so far. Creating the steps has been very easy and it look good on my page",
        "created_at": "2014-07-15T06:54:11.000-04:00",
        "shop_domain": "smartphonehub.myshopify.com",
        "shop_name": "The Smartphone Hut",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Very nice app...a lot of functionality and actually quite easy to use after the a couple of hours.\r\nSuper support, and good help installing the liquid code that can be a little difficult at first.\r\nThe only thing we miss(until now) is a file/photo upload functionality under custom forms... But hopefully that will be added later.\r\nWe look forward to use this very nice app at www.Lasercover.dk when we go live in a few weeks from now.....\r\n",
        "created_at": "2014-07-14T08:34:33.000-04:00",
        "shop_domain": "lasercovers.myshopify.com",
        "shop_name": "LaserCover",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This App just got better. We've been using it live for 3 months now and it really captures the interest of our customers. We wanted a way to let surfers specify their boards in an easy to use and fun way - there was nothing else that comes close to the flexibility Product Builder provides. Our only reservation was the lack of ability to duplicate builders which we raised with Bold and well thats been added as a feature now. So we're super stoked with that. It works reliably, is quick and the integration with the cart is excellent. We've pushed to edges of this to get what we want and it works real well. Thoroughly recommend this App.\r\n\r\nPlus the customer service is totally excellent - the guys at Bold just get the job done quickly and are courtious and helpful - but more importantly - actually do stuff quickly. Its obvious they know what its like to run a small business.\r\n\r\nWe like this App at Endeavour Surf.\r\n\r\nBryan",
        "created_at": "2014-07-10T13:20:18.000-04:00",
        "shop_domain": "endeavour-surf.myshopify.com",
        "shop_name": "Endeavour Surf",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Very nice app. Fairly easy to install and use and virtually unlimited posibilities",
        "created_at": "2014-07-08T03:58:57.000-04:00",
        "shop_domain": "vdsfgdfgfsdg.myshopify.com",
        "shop_name": "vdsfgdfgfsdg",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The app helped me to get my website online and working. It gave me everything I wanted without the costly bespoke developers costs. I would highly rate this app and others as they all form a great link with each other. ",
        "created_at": "2014-07-07T13:02:42.000-04:00",
        "shop_domain": "goofy-beaver.myshopify.com",
        "shop_name": "GoofyBeaver",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "finest app for customization!! ",
        "created_at": "2014-06-29T14:17:24.000-04:00",
        "shop_domain": "jockeytack-2.myshopify.com",
        "shop_name": "JockeyTack",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "App was not working but issued was fixed.  I'll update the review when I actually get to use it. \r\n",
        "created_at": "2014-06-25T13:08:08.000-04:00",
        "shop_domain": "the-little-bird-inc.myshopify.com",
        "shop_name": "Variant \u0026 API Test Site",
        "star_rating": 3
    },
    {
        "author": null,
        "body": "Great app, great integration manual and quite good pricing ! Terima kasih from Indonesia !",
        "created_at": "2014-06-11T22:15:22.000-04:00",
        "shop_domain": "minilovebites.myshopify.com",
        "shop_name": "minilovebites",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is perfect for my custom computer website.  It allows customers to custom build any configuration they want.  It also gives my website a very professional look and feel. ",
        "created_at": "2014-06-11T11:22:08.000-04:00",
        "shop_domain": "elite-custom-pc.myshopify.com",
        "shop_name": "Elite Custom PC",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This company is taking shopify to the next level each and every time they produce a new app. Its actually amazing how you could so simply manage the orders and installation process with-in 48 hours, considering the demand on bold apps. I really appreciate the customer service and professionalism that bold offers to me. ",
        "created_at": "2014-06-10T12:28:28.000-04:00",
        "shop_domain": "smitepcs-com.myshopify.com",
        "shop_name": "SmitePCs.com",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I was a bit confused initially, Bold Apps stood by my side and helped me a lot. Now I will give a good trial to Product Builder. I can see the potential of providing my clients with a configurator, to allow them to decide how to build and purchase certain products. Thank you, Jay. ",
        "created_at": "2014-06-07T20:03:25.000-04:00",
        "shop_domain": "riva-guns.myshopify.com",
        "shop_name": "Riva Guns Ltd. | Long Range Sporting Rifles | Auckland New Zealand ",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I think Bold apps team is really small and they cater to a lot of apps. I tried using this app and every time I had a question I needed to wait for at least 3 days. There is no support after US business hours which would have been OK for me if I stayed in US. I am currently traveling and the service is pretty pathetic as there is no easy way to contact them except to work during US hours as the email responses are delayed by 2-3 days. They also ask people to write positive reviews so that they can extend the free services for apps. I would always go for a free bee as I am a small business owner and I need all the savings I can get. The positive reviews are generated by many people who wanted savings and I am not sure how relevant they are as far as the functionality and service of the app is concerned.",
        "created_at": "2014-05-30T02:14:41.000-04:00",
        "shop_domain": "chicnurv.myshopify.com",
        "shop_name": "RAUES",
        "star_rating": 1
    },
    {
        "author": null,
        "body": "Pricey but seems good so far. ",
        "created_at": "2014-05-28T06:06:27.000-04:00",
        "shop_domain": "starrily.myshopify.com",
        "shop_name": "Starrily",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Good idea for an app, makes it much easier than developing your own customization platform. Great way to go!",
        "created_at": "2014-05-27T13:28:06.000-04:00",
        "shop_domain": "cha-o-ha-design-co.myshopify.com",
        "shop_name": "Cha-O-Ha Design Co.",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This product is exactly what we needed!  It is excellent.  It's like the app was built for our products.  The support staff are also top notch.  They always responded to my messages within hours.  Great job Bold Apps.",
        "created_at": "2014-05-16T08:25:11.000-04:00",
        "shop_domain": "fireti.myshopify.com",
        "shop_name": "FIRETI - TITANIUM MINIMALIST WALLETS",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "FINALLY!!! An app that has solved our product customization!  Wish I found this sooner, it saved a TON of time and $$$! ",
        "created_at": "2014-05-10T12:20:43.000-04:00",
        "shop_domain": "accent-wall-customs.myshopify.com",
        "shop_name": "Accent Wall Customs",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This is a phenomenal app that builds in critical functionality for any store with customizations or add-ons that customers should progress through in steps.  We use it to select engraving plates and then enter the engraving message to be applied to the product.  Simple to use, great support.",
        "created_at": "2014-05-09T22:02:42.000-04:00",
        "shop_domain": "theme-development-4.myshopify.com",
        "shop_name": "Theme Development",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "If it faster and easy to build a product,the possibility for sales increase!\r\n I use Product Builder to do just that. Easy to use and a step by step approach\r\n.I just love it.\r\nJerry",
        "created_at": "2014-05-07T16:10:22.000-04:00",
        "shop_domain": "gassign-com.myshopify.com",
        "shop_name": "Gassign.com",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Awesome app.  Perfect for my customers to build their own video packages.  Amazing support and the install was fast!",
        "created_at": "2014-04-30T11:05:54.000-04:00",
        "shop_domain": "epik-video.myshopify.com",
        "shop_name": "TernPro",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This is the APP I've been looking for for 2 months! I just scrapped our WooCommerce store for a much more stable Shopify based store for our furniture site. WHF furniture is configurable so that you can literally design your own furniture by choosing a top, design, accents, stain color and legs/base style, etc. Well some products end up having more than 8700 possible configurations, which a pretty heavy load on the database. Bold's Product Builder App solved all my issues in 20 minutes. Thank you!!!",
        "created_at": "2014-04-29T22:35:28.000-04:00",
        "shop_domain": "western-heritage-furniture.myshopify.com",
        "shop_name": "Western Heritage Furniture",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "excellent app that really gives you power in your ecommerce shops. I think customers want to be empowered in their choices and this app really does that. Great app.",
        "created_at": "2014-04-28T15:25:28.000-04:00",
        "shop_domain": "anders-larsen.myshopify.com",
        "shop_name": "STARTBOX",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is amazing. It brought our store to another level! In addition, their staff is friendly and very helpful. I would recommend to everyone.",
        "created_at": "2014-04-22T17:11:30.000-04:00",
        "shop_domain": "eff-y-bee.myshopify.com",
        "shop_name": "eff.Y.bee",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great easy application for customizing your products and allowing customers to visualize it. Amazing support team!",
        "created_at": "2014-04-20T03:29:07.000-04:00",
        "shop_domain": "carved-gilt.myshopify.com",
        "shop_name": "Carved Gilt",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Excellent app that gives you options that no other app on Shopify does.\r\n\r\nPositive:\r\n- Well worth the price.\r\n- Great customer service with fast replys.\r\n- Tons of options and customization capabilities.\r\n- Good tutorials.\r\n- Works flawlessly (so far).\r\n\r\nNegative:\r\n- Product Builder is separate to Shopify's collections which means you can't choose a product from your Collection-page and then customizing it.\r\n- Takes a few hours to get the hang of it (no biggy).\r\n- Difficult to fully match you themes layout with the app.\r\n\r\nI give it 5 starts due to its relatively easy use compared to the amount of customization, the customer service included and the seemingly flawlessly operation. I was not able to use the app myself but not because of the app itself. I just had different needs.",
        "created_at": "2014-04-16T05:40:30.000-04:00",
        "shop_domain": "riwedd.myshopify.com",
        "shop_name": "RiWedd",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "It takes time to understand and is doable. I am not an online whiz and I did not get frustrated using this application to generate the level of customization that I need. The excellent customer service definitely helped me out.",
        "created_at": "2014-04-06T00:05:39.000-04:00",
        "shop_domain": "marking-memories.myshopify.com",
        "shop_name": "Marking Memories",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Amazing app. Custom designs are our bread-and-butter -- this app is simple to use, and creates the functionality we need. Beautifully.\r\n\r\nIt just plain WORKS.",
        "created_at": "2014-03-30T06:38:36.000-04:00",
        "shop_domain": "karmareturns.myshopify.com",
        "shop_name": "Karma Returns",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Loving this App! Easy to use app, friendly and fast response customer service.",
        "created_at": "2014-03-22T23:03:18.000-04:00",
        "shop_domain": "nicholasing.myshopify.com",
        "shop_name": "nicholasing",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "I'm very disappointed. It is so hard to use this application. Especially if you making very complicated builder. Options are not always saved, so if you done several new options, saved you work, you may find out that you lost everything you done! Descriptions are converted into html, you need to reedit each one every time. No option to let customer pick quantity in builder. To be honest, for this much money I would expect something better quality. ",
        "created_at": "2014-03-21T09:38:30.000-04:00",
        "shop_domain": "co2art.myshopify.com",
        "shop_name": "CO2Art",
        "star_rating": 2
    },
    {
        "author": null,
        "body": "Awesome application and easy to use! In the process of setting up my products now, this app really helps distinguish myself from everybody else. ",
        "created_at": "2014-03-18T06:35:21.000-04:00",
        "shop_domain": "vitarmory.myshopify.com",
        "shop_name": "vitarmory",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Another great app from BOLD: after Product Options, Product Discount, Quantity breaks and Product Upsell, now it's time to play with Product Builder on one of our stores, and we have been impressed by this app. Easy to use, flexible and reliable, it really improves the user experience on our site.",
        "created_at": "2014-03-17T13:30:38.000-04:00",
        "shop_domain": "gerardisnc.myshopify.com",
        "shop_name": "Gerard",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I decided to build my website through Shopify based on this app alone.  It is the only app like it around.  It is fast and easy and anyone can you use.....trust me, i had no experience at all!!!",
        "created_at": "2014-03-15T00:15:22.000-04:00",
        "shop_domain": "kreation-candles.myshopify.com",
        "shop_name": "Kreation Candles",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "A great app, easy to use and does exactly what it is supposed to do. There is also an informative support team whenever you have questions that need answering. Very satisfied.",
        "created_at": "2014-03-06T20:14:46.000-05:00",
        "shop_domain": "gaguar-tailoring.myshopify.com",
        "shop_name": "Gaguar",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Legit app that lets you take customer product customizing to the next level, thanks Bold!",
        "created_at": "2014-03-04T12:33:35.000-05:00",
        "shop_domain": "customyi.myshopify.com",
        "shop_name": "iRIS",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I am absolutely blown away by the quality of the product and the customer service provided by BOLD.  This is the second app (I also have quantity breaks installed) that I have downloaded.  The customer service is incredible in giving you options to instal yourself (which I was easily able to do for quantity breaks), or contact them for support.  \r\n\r\nWhen I contacted customer support when I had trouble installing myself, they were not only extremely quick to respond, but also very thorough in ensuring that I had the best experience with their product.\r\n\r\nFinally, BOLD is amazing because they clearly know Shopify.  They make it easy to integrate their product and service into all of your products and services without a lot of repeated procedures.  You create your customizations and you can apply them to all of your products.\r\n\r\nI highly recommend this app, and any others from BOLD, as they clearly have a great solution that matches quality software with personal and quick customer service.",
        "created_at": "2014-02-25T23:31:56.000-05:00",
        "shop_domain": "target-screen-print.myshopify.com",
        "shop_name": "Stick It Dog!",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I love this app.   I am able to offer a level of customization to customers that was previously unavailable. I look forward being able to increase my catering options for my customers. Awesome app!",
        "created_at": "2014-02-20T18:21:55.000-05:00",
        "shop_domain": "shopndrop-groceries.myshopify.com",
        "shop_name": "Shop N Drop Groceries",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Amazing App and customer service was amazing! They were very responsive and helpful and got us situated immediately!",
        "created_at": "2014-02-20T13:10:09.000-05:00",
        "shop_domain": "muzzleshot-2.myshopify.com",
        "shop_name": "Muzzleshot",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This is a cool app. I sell custom made jewelry, and I want my customers to be able to see how their jewelry will look before they purchase it. I'm new to Shopify, and my customer service representative recommended this app. It's quite powerful, and I can set it up to display many custom options. I recommend it for anyone who wants to sell custom merchandise on their e-retail store. I really appreciate the free trial!!",
        "created_at": "2014-02-18T20:05:18.000-05:00",
        "shop_domain": "charm-her.myshopify.com",
        "shop_name": "Charm Her",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app.  Allows us to build kits!!",
        "created_at": "2014-02-17T15:40:11.000-05:00",
        "shop_domain": "elemental-vapor-eliquid-and-ecigarettes.myshopify.com",
        "shop_name": "Heisenvapes Electronic Cigarettes",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app, I've been looking for something like this.",
        "created_at": "2014-02-12T16:41:51.000-05:00",
        "shop_domain": "cashletes.myshopify.com",
        "shop_name": "Cashletes",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "awesome app.......It is working exactly what I wanted...simply the best app for my business I would say!",
        "created_at": "2014-02-11T09:45:43.000-05:00",
        "shop_domain": "madovar-packaging.myshopify.com",
        "shop_name": "Madovar Packaging",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I see HUGE potential in this app.  I'm excited to get started with it!  It's exactly what my custom shop has been missing.",
        "created_at": "2014-02-11T00:48:34.000-05:00",
        "shop_domain": "swagbot.myshopify.com",
        "shop_name": "SWAGBOT",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app has been a life saver for our store! We offer customized clocks and have so many options and this app was able to make the customer experience fun! To be able to \"build\" your clock and watch as the images swap out has been fantastic!",
        "created_at": "2014-02-06T13:00:11.000-05:00",
        "shop_domain": "stone-creek-furniture.myshopify.com",
        "shop_name": "Stone Creek Furniture",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app!  Easily increases sales without the customer feeling sold.",
        "created_at": "2014-02-03T10:58:26.000-05:00",
        "shop_domain": "mydittobee.myshopify.com",
        "shop_name": "DittoBee Photo Scanning",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Fantastic, it has solved so many of my problems with setting options/variants, and making the customising experience more involved, and fun, for the customer. We offer custom made/custom sized products with far too many options for Shopify to handle alone. I definitely recommend this app. Pays for itself in no time.",
        "created_at": "2014-02-03T04:14:12.000-05:00",
        "shop_domain": "tracksupermarket.myshopify.com",
        "shop_name": "tracksupermarket",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I think this is the best app I've come across on any platform, great to customise and i really love it. thanks guys!",
        "created_at": "2014-02-01T16:20:38.000-05:00",
        "shop_domain": "mckillopsales.myshopify.com",
        "shop_name": "McKillopSales",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "The product builder is great, but I did come across a glitch. While the customer support team was very responsive, I struggled in getting them to understand the problem I was experiencing.",
        "created_at": "2014-01-31T14:24:47.000-05:00",
        "shop_domain": "tuxedos-to-geaux.myshopify.com",
        "shop_name": "Tuxedos To Geaux",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "My site carries a custom clothing, this app was perfect for product customization. I was able to get it figured out and be up and running in no time. My customers are going to love it.",
        "created_at": "2014-01-29T10:07:48.000-05:00",
        "shop_domain": "trendytreat.myshopify.com",
        "shop_name": "trendytreat",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is awesome.  It allows me to construct custom orders exactly the way I need to.  It is very to create a step by step process for my customers to order...and also provide them with great tutorial information along the way.  I highly recommend.  \r\n",
        "created_at": "2014-01-23T20:05:57.000-05:00",
        "shop_domain": "sunburstblinds.myshopify.com",
        "shop_name": "SunBurst Blinds",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app has allowed us to take a very customizable product with endless possibilities for combinations of options and stream line the process. Now a customer simple clicks types and presses enter rather than spending hours writing emails or on the phone. \r\n\r\nOnce installed the guys at BOLD APPS keep the service going with online chats that have greatly smoothed out some installation issues. Mike was always very helpful in saying \"Let me take a look\". He would then go in to the code, clean it up, and get it working perfectly.\r\n\r\nThis is our companies second product from Bold and we will be returning again and again! ",
        "created_at": "2014-01-07T14:00:49.000-05:00",
        "shop_domain": "mirage-systems-3.myshopify.com",
        "shop_name": "Mirage Systems ",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "This app is very powerful, but also intimidating.  I did not set it up for two weeks simply because it was overwhelming.  Wish it came with one free configuration. ",
        "created_at": "2014-01-03T12:32:19.000-05:00",
        "shop_domain": "completely-royal.myshopify.com",
        "shop_name": "Completely Royal",
        "star_rating": 3
    },
    {
        "author": null,
        "body": "Been searching for a aesthetically pleasing and simple yet powerfull product configurator for highly configurable physcial products. We need this to allow customers to browse through and understand the product features we offer and understand their own needs. I think we may just have found the shortcut to providing this with no coding costs and very little internal cost for upkeep. We are really excited about this - you want to take a close look at this app if your requirements and needs are similar to ours!",
        "created_at": "2013-12-30T04:27:07.000-05:00",
        "shop_domain": "gbioline.myshopify.com",
        "shop_name": "GBioline",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "My colleague and I have been searching forever on how to be able to get live with an ecommerce idea that we have had.  The customizability and functionality that product builder offers was able to be the starting point for us to get our idea off the ground and should be live very soon!  Could use a little more documentation but overall a great concept.",
        "created_at": "2013-12-15T22:13:04.000-05:00",
        "shop_domain": "thecavebox.myshopify.com",
        "shop_name": "TheCaveBox",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "We have been searching long and hard for a platform that could enable this level of product custimisation. This app is exactly what we needed and on the technical side of things the bold customer service is excellent.",
        "created_at": "2013-11-27T04:45:02.000-05:00",
        "shop_domain": "thedeadgoodfurnitureshop.myshopify.com",
        "shop_name": "www.deadgoodshop.com",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Awesome app.  We went with Shopify over the other engines because of this app alone.  If you're looking to build out a \"buyers guide\" for more complex products you really need to look at this app.\r\n\r\nOnly downside was not being able to create conditional logic from the custom form fields (checkboxes, radio buttons, etc.), but Ron at Bold apps has aid that they will add this to the feature list for future releases.  I hope so, that would make this app unstoppable.",
        "created_at": "2013-11-26T14:30:07.000-05:00",
        "shop_domain": "poctest.myshopify.com",
        "shop_name": "POCTest",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Great app for creating custom products! Simple to use and learn. Was able to create exactly what I wanted for my customers.",
        "created_at": "2013-11-25T07:25:43.000-05:00",
        "shop_domain": "jazzed-creations.myshopify.com",
        "shop_name": "Jazzed Creations",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "We are in the Online Retail Jewelry business and we offer our customer customized rings and this app was exact fit for us. THANK YOU SO MUCH GUYS! All of their app helped our business grow thank you so much guys really I meant it.",
        "created_at": "2013-11-21T22:14:21.000-05:00",
        "shop_domain": "tecerian-jewelry.myshopify.com",
        "shop_name": "Tecerian Jewelry",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is amazing, it has let me create my own custom boot builder which I was quoted thousands to make from a developer! It is really easy to use, but the best thing about Product Builder is the support - very helpful staff helped me out with some bits and bobs (Im useless with this sort of thing!) Thank you so much for your help",
        "created_at": "2013-11-19T17:18:32.000-05:00",
        "shop_domain": "the-boot-room.myshopify.com",
        "shop_name": "Dukes Boots",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This app is so amazing, it makes something like a customizer affordable, of a very good quality available to the merchants like us. I am so happy that i can finally sell my customized tees!\r\n\r\nThank you very much for the app, mi headaches have disappeared searching for a customizer at good price!",
        "created_at": "2013-11-17T10:18:26.000-05:00",
        "shop_domain": "colovrs.myshopify.com",
        "shop_name": "Colovrs",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "App has great potential for our application. With a few minor tweaks, clients can build custom product combinations in a few minutes. Customizing the App itself is reasonably easy for non-coders like myself. ",
        "created_at": "2013-11-13T08:56:55.000-05:00",
        "shop_domain": "the-miami-company-llc.myshopify.com",
        "shop_name": "The Miami Company LLC",
        "star_rating": 4
    },
    {
        "author": null,
        "body": "Great product, it has all of the features I was looking for. Is easy to use and it doesnt have any coding required.",
        "created_at": "2013-11-11T10:04:41.000-05:00",
        "shop_domain": "cisco-ucs.myshopify.com",
        "shop_name": "Cisco UCS",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I installed this a few weeks ago and it was pretty easy to do. I had some issues with the information that was displayed on our shipping documents, but I contacted their customer support and they fixed the issue. Working great now, from the website all the way through to our shipping software. I highly recommend if you have a build your own product. ",
        "created_at": "2013-11-07T13:34:04.000-05:00",
        "shop_domain": "rawgeneration.myshopify.com",
        "shop_name": "Raw Generation Juices",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I gave a speech the other night saying that my business is the first company in men's fashion history to streamline a custom tie builder online. I could not have been able to say that without Bold Apps new Product Builder tool. People started clapping.\r\n\r\nHOW MY BUSINESS USES THE APP\r\nSKINNYFATTIES uses this tool to allow customers to design their own tie. From the width, to the main fabric, to the lining fabric, customers have the ability to custom create neckties that best suits them. \r\n\r\nEASE OF MERCHANT SET-UP\r\nI thought this would be a daunting process. I was wrong. This app was well-thought-out and allows merchants to quickly assign variants and images in minutes. It easily links with products and works seamlessly with your cart.\r\n\r\nCUSTOMER USER INTERFACE\r\nWithin a few days, I had orders. That directly attributes to how easy this tool is to use  my customers love it!\r\n\r\nAPP CUSTOMER SERVICE\r\nI had a few theme issues and Bold Apps was quick to respond, offering help and guidance along the way.\r\n\r\nOVERALL\r\nThis app is great and well worth the few extra bucks.",
        "created_at": "2013-11-06T15:55:37.000-05:00",
        "shop_domain": "skinnyfatties.myshopify.com",
        "shop_name": "SKINNYFATTIES",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I love this app.  Had a couple issues with the installation but the Bold team took care of it so I'm a happy camper.  Great service and excellent apps!",
        "created_at": "2013-11-05T12:25:56.000-05:00",
        "shop_domain": "lab-eleven-nineteen.myshopify.com",
        "shop_name": "Lab 1119",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Customizations are super important to my business as a makeup brush retailer. With this product builder, customizations' a breeze! (: My customers can now create their fav set of makeup brushes! :D It's awesome!",
        "created_at": "2013-10-30T16:40:12.000-04:00",
        "shop_domain": "13rushes.myshopify.com",
        "shop_name": "13rushes- Singapore's Makeup Brushes",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This is a really great app that truly does allow your store to be showcased in a different light. Go ahead and try them out! Although there is a little bit of a learning curve, you will be pleasantly surprised at how your store turns out after you use it! ",
        "created_at": "2013-10-30T09:47:11.000-04:00",
        "shop_domain": "niglio-design.myshopify.com",
        "shop_name": "NiglioDesign.com",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "We can't say enough about the team at bold! Not only are their apps well developed and easy to implement into our store, their support staff is the best!. Product builder s going to be a game changer for us.  We will be able to offer something in our industry that doesn't exist today. ",
        "created_at": "2013-10-22T19:56:39.000-04:00",
        "shop_domain": "autotexwipers.myshopify.com",
        "shop_name": "AutoTexWipers",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Bold Apps is a great company doing great things with great customer service. We poked them with a stick and waved money in their face until they built Product Builder for us. We build design, engineer, manufacture and market tablet kiosks and while shopify has been a great platform for us we have had issues managing our ever growing catalog of products. With the launch of our generation 2.0 product that had soooo many more options than before it just was not feasible to use the old catalog method for selling our products. Enter Product Builder. James and his team were excellent to work with, they listened hard and tweaked and re-tweaked as work progressed. Product Builder has really helped ease our customer's order process and easy ordering = more sales. We couldn't be happier and hope the rest of the Shopify community leverages the work to promote their custom \u0026 customized products! ",
        "created_at": "2013-10-11T18:03:43.000-04:00",
        "shop_domain": "lilipad-kiosk.myshopify.com",
        "shop_name": "Lilitab",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Product Builder has been a lifesaver!  My client wanted an online shop using Shopify, but then they threw us a curve ball.  She wanted totally customizable swimwear with so many price point impacts that we really had no solution other than tons of $ and development time.  Bold Apps was great, they suggested their new product and implemented it for us while we could focus on completing everything else.  Would highly recommend!  ",
        "created_at": "2013-10-07T18:08:02.000-04:00",
        "shop_domain": "lulu-choi-swimwear.myshopify.com",
        "shop_name": "Lulu Choi Swimwear",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Really great app, very easy to use and you can customize the way everything looks. A must if you sell customized products.",
        "created_at": "2013-10-03T06:13:32.000-04:00",
        "shop_domain": "dressfactory4.myshopify.com",
        "shop_name": "dressfactory4",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "So, I can't lie about how excited I am about this app!  Being in the custom product realm hasn't been visually pleasing until now.  If you offer anything personalized or customized, get this app.\r\n\r\nSpend the money!  You can now look like a million bucks for only a small handful of bucks per month.  LOVE.  LOVE.  LOVE............LOVE.",
        "created_at": "2013-10-01T14:02:56.000-04:00",
        "shop_domain": "29th-and-sweet-online.myshopify.com",
        "shop_name": "Lab 1119",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app, about time someone nailed a decent product builder app. I use this app for my online gift baskets. ",
        "created_at": "2013-09-26T00:16:14.000-04:00",
        "shop_domain": "gangemis-fine-wines-food.myshopify.com",
        "shop_name": "Gangemi's Fine Wines \u0026 Food",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "I have been using this app for about a month.  It was super easy to setup an very well integrated with my shopify storefront.  It increased by bottom line on day one by significantly reducing the number of SKUs within our eCom.  That kept us in the lower charge per month bracket while allowing us to significantly increasing the number of products we have on line!  Great Job, love the APP.",
        "created_at": "2013-09-25T20:27:36.000-04:00",
        "shop_domain": "reel-draggin-tackle.myshopify.com",
        "shop_name": "Reel Draggin' Tackle",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "This is the only way that I can really keep track of inventory because most of my products are custom. I can't keep track of this just in shopify. I'm glad I found it! ",
        "created_at": "2013-09-25T18:20:27.000-04:00",
        "shop_domain": "getunrobed.myshopify.com",
        "shop_name": "getunrobed",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "First of its kind for Shopify, this Bold app is just the thing to get customers buying more accessories.  There's a reason auto companies have been allowing custom builds for years!",
        "created_at": "2013-09-25T16:12:30.000-04:00",
        "shop_domain": "superwinchexperts.myshopify.com",
        "shop_name": "superwinchexperts",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Great app, easy set up, great customer service! These guys really know what they are doing! Nice work team Bold!",
        "created_at": "2013-09-25T15:11:57.000-04:00",
        "shop_domain": "xwatch.myshopify.com",
        "shop_name": "X-Watch",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Amazing product!  This was the perfect product for my customers.  I first attempted to have someone custom build and the level of what I needed was not quite there and the project was becoming quite costly.  This app could not have come at a better time and was perfect for me.  It's the only app product of its kind (that I am aware of) that allows for customers to build their products and interactively see what their design looks like.  This app works well and exceeded my expectations (functionally and aesthetically). Highly recommend.",
        "created_at": "2013-09-25T12:25:16.000-04:00",
        "shop_domain": "laurenaaccessories.myshopify.com",
        "shop_name": "Laurena Accessories",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Bold Apps has done it again! Product Builder is another fantastic app, allowing us to make our build-your-own products easy to navigate; customers love using it and it's super user-friendly on our end. 5 stars!",
        "created_at": "2013-09-25T11:11:31.000-04:00",
        "shop_domain": "furls.myshopify.com",
        "shop_name": "FurlsCrochet",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Another Bold app from our favorite designers!  This is another awesome offering that really is exactly what we have been looking for.\r\n\r\nA lot of products that we sell have multiple parts that need to be configured.  This app makes that process easy and really user friendly for our customers.\r\n\r\nThanks for continuing to push the bar, keep it up!",
        "created_at": "2013-09-25T11:03:52.000-04:00",
        "shop_domain": "lansify.myshopify.com",
        "shop_name": "waybuild",
        "star_rating": 5
    },
    {
        "author": null,
        "body": "Another fine app from the team at Bold Apps that we highly recommend for any Shopify store.  Customers can now customize their own package with ease.  This app makes it a breeze to add a number of products with its intuitive and highly customizable interface.  Something that would cost thousands of dollars is now within easy reach at an affordable price for all.",
        "created_at": "2013-09-25T10:49:35.000-04:00",
        "shop_domain": "digifuse.myshopify.com",
        "shop_name": "Digislider",
        "star_rating": 5
    }]
}